In [1]:
import pandas as pd
df=pd.read_csv(r"C:\Users\vasup\Downloads\messy_customer_orders.csv")

In [2]:
print("Shape:",df.shape)
print("\nInfo:")
print(df.info())

Shape: (120, 6)

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Customer_Name  120 non-null    object
 1   Product        120 non-null    object
 2   Quantity       105 non-null    object
 3   Unit_Price     91 non-null     float64
 4   Order_Date     93 non-null     object
 5   City           120 non-null    object
dtypes: float64(1), object(5)
memory usage: 5.8+ KB
None

In [3]:
print("\nFirst 10 rows:")
df.head(10)

First 10 rows:

,Customer_Name,Product,Quantity,Unit_Price,Order_Date,City
0,charlie,hair oil,3,199.0,NaN,Mumbai
1,diana,Conditioner,NaN,249.0,4-02-2024,delhi
2,charlie,SERUM,2,199.0,2024-09-10 00:00:00,Bangalore
3,ALICE,Conditioner,two,199.0,2024-04-23 00:00:00,bangalore
4,charlie,Shampoo,2,199.0,2024/5/14,Delhi
5,alice,conditioner,3,199.0,NaN,mumbai
6,Eve,hair oil,3,299.0,2024-01-17 00:00:00,mumbai
7,diana,Shampoo,NaN,NaN,12-02-2024,bangalore
8,alice,hair oil,2,249.0,2024-03-10 00:00:00,Bangalore
9,Charlie,Serum,1,NaN,NaN,mumbai

In [4]:
#strip whitespace
df["Customer_Name"]=df["Customer_Name"].astype(str).str.strip()
df["Product"]=df["Product"].astype(str).str.strip()
df["City"]=df["City"].astype(str).str.strip()

In [6]:
print(df.Customer_Name)

0      charlie
1        diana
2      charlie
3        ALICE
4      charlie
        ...
115        Eve
116        Eve
117      ALICE
118      alice
119        Eve
Name: Customer_Name, Length: 120, dtype: object

In [9]:
# Standardize casing
df["Customer_Name"]=df["Customer_Name"].str.title()
df["Product"]=df["Product"].str.title()
df["City"]=df["City"].str.title()

In [10]:
# Fix known product variations
product_map = {
    "Shampoo": "Shampoo",
    "Shampoo ": "Shampoo",
    "Conditioner": "Conditioner",
    "Conditioner ": "Conditioner",
    "Hair Oil": "Hair Oil",
    "Hair Oil ": "Hair Oil",
    "Serum": "Serum",
    "Serum ": "Serum",
}

In [11]:
df["Product"] = df["Product"].replace(product_map)

In [12]:
# Check cleaned text columns
df[["Customer_Name", "Product", "City"]].head(10)

  Customer_Name      Product       City
0       Charlie     Hair Oil     Mumbai
1         Diana  Conditioner      Delhi
2       Charlie        Serum  Bangalore
3         Alice  Conditioner  Bangalore
4       Charlie      Shampoo      Delhi
5         Alice  Conditioner     Mumbai
6           Eve     Hair Oil     Mumbai
7         Diana      Shampoo  Bangalore
8         Alice     Hair Oil  Bangalore
9       Charlie        Serum     Mumbai

In [13]:
df[["Customer_Name", "Product", "City"]].head(10)

  Customer_Name      Product       City
0       Charlie     Hair Oil     Mumbai
1         Diana  Conditioner      Delhi
2       Charlie        Serum  Bangalore
3         Alice  Conditioner  Bangalore
4       Charlie      Shampoo      Delhi
5         Alice  Conditioner     Mumbai
6           Eve     Hair Oil     Mumbai
7         Diana      Shampoo  Bangalore
8         Alice     Hair Oil  Bangalore
9       Charlie        Serum     Mumbai

In [14]:
# Convert Quantity to string and strip spaces
df["Quantity"] = df["Quantity"].astype(str).str.strip()

In [15]:
# Map written numbers to digits
word_to_num = {
    "one": 1,
    "two": 2,
    "three": 3,
    "four": 4
}

In [16]:
# Convert written words to numbers
df["Quantity"] = df["Quantity"].replace(word_to_num)

In [17]:
# Convert numeric-like strings to numbers
df["Quantity"] = pd.to_numeric(df["Quantity"], errors="coerce")

In [18]:
# Fill missing Unit Price using median per product
df["Unit_Price"] = df.groupby("Product")["Unit_Price"].transform(
    lambda x: x.fillna(x.median())
)

In [19]:
# Calculate Total Amount
df["Total_Amount"] = df["Quantity"] * df["Unit_Price"]

In [20]:
# Show result
df[["Product", "Quantity", "Unit_Price", "Total_Amount"]].head(10)

       Product  Quantity  Unit_Price  Total_Amount
0     Hair Oil       3.0       199.0         597.0
1  Conditioner       NaN       249.0           NaN
2        Serum       2.0       199.0         398.0
3  Conditioner       2.0       199.0         398.0
4      Shampoo       2.0       199.0         398.0
5  Conditioner       3.0       199.0         597.0
6     Hair Oil       3.0       299.0         897.0
7      Shampoo       NaN       249.0           NaN
8     Hair Oil       2.0       249.0         498.0
9        Serum       1.0       249.0         249.0

In [21]:
# Convert to datetime with multiple format handling
df["Order_Date"] = pd.to_datetime(
    df["Order_Date"], 
    errors="coerce", 
    dayfirst=False
)

In [22]:
# Extract date parts
df["Order_Year"] = df["Order_Date"].dt.year
df["Order_Month"] = df["Order_Date"].dt.month
df["Order_Day"] = df["Order_Date"].dt.day

In [23]:
# Display results
df[["Order_Date", "Order_Year", "Order_Month", "Order_Day"]].head(10)

  Order_Date  Order_Year  Order_Month  Order_Day
0        NaT         NaN          NaN        NaN
1 2024-04-02      2024.0          4.0        2.0
2        NaT         NaN          NaN        NaN
3        NaT         NaN          NaN        NaN
4        NaT         NaN          NaN        NaN
5        NaT         NaN          NaN        NaN
6        NaT         NaN          NaN        NaN
7 2024-12-02      2024.0         12.0        2.0
8        NaT         NaN          NaN        NaN
9        NaT         NaN          NaN        NaN

In [24]:
df[["Order_Date", "Order_Year", "Order_Month", "Order_Day"]].head(10)

  Order_Date  Order_Year  Order_Month  Order_Day
0        NaT         NaN          NaN        NaN
1 2024-04-02      2024.0          4.0        2.0
2        NaT         NaN          NaN        NaN
3        NaT         NaN          NaN        NaN
4        NaT         NaN          NaN        NaN
5        NaT         NaN          NaN        NaN
6        NaT         NaN          NaN        NaN
7 2024-12-02      2024.0         12.0        2.0
8        NaT         NaN          NaN        NaN
9        NaT         NaN          NaN        NaN

In [25]:
# 1. Check duplicates
print("Duplicate rows:", df.duplicated().sum())

Duplicate rows: 12

In [26]:
# 2. Remove duplicates
df = df.drop_duplicates()

In [27]:
# 3. Missing values summary
print("\nMissing values per column:")
print(df.isna().sum())

Missing values per column:
Customer_Name     0
Product           0
Quantity         15
Unit_Price        0
Order_Date       93
City              0
Total_Amount     15
Order_Year       93
Order_Month      93
Order_Day        93
dtype: int64

In [28]:
# 4. Show rows with missing Quantity
print("\nRows with missing Quantity:")
df[df["Quantity"].isna()].head()

Rows with missing Quantity:

,Customer_Name,Product,Quantity,Unit_Price,Order_Date,City,Total_Amount,Order_Year,Order_Month,Order_Day
1,Diana,Conditioner,NaN,249.0,2024-04-02,Delhi,NaN,2024.0,4.0,2.0
7,Diana,Shampoo,NaN,249.0,2024-12-02,Bangalore,NaN,2024.0,12.0,2.0
10,Diana,Shampoo,NaN,249.0,NaT,Delhi,NaN,NaN,NaN,NaN
12,Charlie,Shampoo,NaN,299.0,NaT,Delhi,NaN,NaN,NaN,NaN
29,Bob,Serum,NaN,299.0,2024-01-08,Delhi,NaN,2024.0,1.0,8.0

In [29]:
# 5. Show rows with missing Order_Date
print("\nRows with missing Order_Date:")
df[df["Order_Date"].isna()].head()

Rows with missing Order_Date:

,Customer_Name,Product,Quantity,Unit_Price,Order_Date,City,Total_Amount,Order_Year,Order_Month,Order_Day
0,Charlie,Hair Oil,3.0,199.0,NaT,Mumbai,597.0,NaN,NaN,NaN
2,Charlie,Serum,2.0,199.0,NaT,Bangalore,398.0,NaN,NaN,NaN
3,Alice,Conditioner,2.0,199.0,NaT,Bangalore,398.0,NaN,NaN,NaN
4,Charlie,Shampoo,2.0,199.0,NaT,Delhi,398.0,NaN,NaN,NaN
5,Alice,Conditioner,3.0,199.0,NaT,Mumbai,597.0,NaN,NaN,NaN

In [31]:
#Top selling products by Quntity
top_products=df.groupby("Product")["Quantity"].sum().sort_values(ascending=False)
top_products

Product
Shampoo        68.0
Conditioner    59.0
Serum          59.0
Hair Oil       48.0
Name: Quantity, dtype: float64

In [32]:
#Revenue by Product
revenue_by_product=df.groupby("Product")["Total_Amount"].sum().sort_values(ascending=False)
revenue_by_product

Product
Shampoo        16932.0
Serum          14391.0
Conditioner    14241.0
Hair Oil       11802.0
Name: Total_Amount, dtype: float64

In [33]:
#Revenue by City
revenue_by_city=df.groupby("City")["Total_Amount"].sum().sort_values(ascending=False)
revenue_by_city

City
Bangalore    21363.0
Mumbai       18327.0
Delhi        17676.0
Name: Total_Amount, dtype: float64

In [34]:
#Top customers by Total Spend
top_customers=df.groupby("Customer_Name")["Total_Amount"].sum().sort_values(ascending=False)
top_customers

Customer_Name
Alice      15734.0
Bob        12202.0
Diana      11205.0
Charlie    10208.0
Eve         8017.0
Name: Total_Amount, dtype: float64

In [36]:
#Monthly trend
monthly_trend = (
    df.dropna(subset=["Order_Date"])
      .groupby(["Order_Year", "Order_Month"])["Total_Amount"]
      .sum()
      .sort_index()
)

monthly_trend

Order_Year  Order_Month
2024.0      1.0            1494.0
            2.0             647.0
            4.0               0.0
            7.0             498.0
            8.0             398.0
            9.0             996.0
            10.0            897.0
            12.0           1892.0
Name: Total_Amount, dtype: float64

In [42]:
#Creating Reusable cleaning function
def clean_customer_orders(df):
    """Cleans messy customer order data:
    -text cleaning
    -quantity+price cleanup
    -data parsing
    -calculate Total Amount
    -add year/month/day columns
    -remove duplicates
    """
    for col in ["Customer_Name","Product", "City"]:
        df[col]=df[col].astype(str).str.strip().str.title()
    
    product_map= {
        "Shampoo": "Shampoo",
        "Conditioner": "Conditioner",
        "Hair Oil": "Hair Oil",
        "Serum": "Serum",
    }
    df["Product"] = df["Product"].replace(product_map)
    df["Quantity"] = df["Quantity"].astype(str).str.strip()
    word_to_num = {
        "one": 1,
        "two": 2,
        "three": 3,
        "four": 4
    }
    df["Quantity"] = df["Quantity"].replace(word_to_num)
    df["Quantity"] = pd.to_numeric(df["Quantity"], errors="coerce")
    df["Unit_Price"] = pd.to_numeric(df["Unit_Price"], errors="coerce")
    df["Unit_Price"] = df.groupby("Product")["Unit_Price"].transform(
        lambda x: x.fillna(x.median())
    )
    df["Order_Date"] = pd.to_datetime(df["Order_Date"], errors="coerce")
    df["Order_Year"] = df["Order_Date"].dt.year
    df["Order_Month"] = df["Order_Date"].dt.month
    df["Order_Day"] = df["Order_Date"].dt.day

    df["Total_Amount"] = df["Quantity"] * df["Unit_Price"]
    df = df.drop_duplicates()
    return df
clean_df = clean_customer_orders(df.copy())
clean_df.head()

,Customer_Name,Product,Quantity,Unit_Price,Order_Date,City,Total_Amount,Order_Year,Order_Month,Order_Day
0,Charlie,Hair Oil,3.0,199.0,NaT,Mumbai,597.0,NaN,NaN,NaN
1,Diana,Conditioner,NaN,249.0,2024-04-02,Delhi,NaN,2024.0,4.0,2.0
2,Charlie,Serum,2.0,199.0,NaT,Bangalore,398.0,NaN,NaN,NaN
3,Alice,Conditioner,2.0,199.0,NaT,Bangalore,398.0,NaN,NaN,NaN
4,Charlie,Shampoo,2.0,199.0,NaT,Delhi,398.0,NaN,NaN,NaN